       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-MSG PIC X(30) VALUE 'Hello from COBOL'.
       PROCEDURE DIVISION.
           DISPLAY WS-MSG.
           STOP RUN.
